ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/QSPI_QSPI_48200000h.xml
<module name="QSPI" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="QSPI_PID" acronym="QSPI_PID" offset="0" width="32" description="PID.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="The scheme of the register used. This indicates the PDR3.5 Method" range="31:30" rwaccess="R"/>
	<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Always read as 0" range="29:28" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x3904" description="The function of the module being used" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="RTL Release Version The PDR release number of this IP" range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major Release Number" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom IP" range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor Release Number" range="5:0" rwaccess="R"/>
	</register><register id="QSPI_MSS_QSPI_RESERVED1" acronym="QSPI_MSS_QSPI_RESERVED1" offset="4" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED2" acronym="QSPI_MSS_QSPI_RESERVED2" offset="8" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED3" acronym="QSPI_MSS_QSPI_RESERVED3" offset="12" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED4" acronym="QSPI_MSS_QSPI_RESERVED4" offset="20" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED5" acronym="QSPI_MSS_QSPI_RESERVED5" offset="24" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED6" acronym="QSPI_MSS_QSPI_RESERVED6" offset="28" width="32" description="Reserved.">
		</register><register id="QSPI_INTR_STATUS_RAW_SET" acronym="QSPI_INTR_STATUS_RAW_SET" offset="32" width="32" description="INTR Interrupt Status Raw/Set Register.">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31:2" rwaccess="R"/>
	<bitfield id="WIRQ_RAW" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt Status Read indicates raw status0 = inactive1 = activeWriting 1 will set statusWriting 0 has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="FIRQ_RAW" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt StatusRead indicates raw status0 = inactive1 = activeWriting 1 will set statusWriting 0 has no effect" range="0" rwaccess="R/W"/>
	</register><register id="QSPI_INTR_STATUS_ENABLED_CLEAR" acronym="QSPI_INTR_STATUS_ENABLED_CLEAR" offset="36" width="32" description="INTR Interrupt Status Enabled/Clear Register.">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31:2" rwaccess="R"/>
	<bitfield id="WIRQ_ENA" width="1" begin="1" end="1" resetval="0x0" description="Word  Interrupt Enabled StatusRead indicates enabled status0 = inactive1 = activeWriting 1 will clear interruptWriting 0 has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="FIRQ_ENA" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt Enabled StatusRead indicates enabled status0 = inactive1 = activeWriting 1 will clear interruptWriting 0 has no effect" range="0" rwaccess="R/W"/>
	</register><register id="QSPI_INTR_ENABLE_SET" acronym="QSPI_INTR_ENABLE_SET" offset="40" width="32" description="INTR Interrupt Enable/Set Register.">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31:2" rwaccess="R"/>
	<bitfield id="WIRQ_ENA_SET" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt  Enable/SetRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will set interrupt enabledWriting 0 has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="FIRQ_ENA_SET" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt Enable/SetRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will set interrupt enabledWriting 0 has no effect" range="0" rwaccess="R/W"/>
	</register><register id="QSPI_INTR_ENABLE_CLEAR" acronym="QSPI_INTR_ENABLE_CLEAR" offset="44" width="32" description="INTR Interrupt Enable/Clear Register.">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31:2" rwaccess="R"/>
	<bitfield id="WIRQ_ENA_CLR" width="1" begin="1" end="1" resetval="0x0" description="Word Interrupt  Enable/ClearRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will clear interrupt enabledWriting 0 has no effect" range="1" rwaccess="R/W"/>
	<bitfield id="FIRQ_ENA_CLR" width="1" begin="0" end="0" resetval="0x0" description="Frame Interrupt  Enable/ClearRead indicates interrupt enable0 = disabled1 = enabledWriting 1 will clear interrupt enabledWriting 0 has no effect" range="0" rwaccess="R/W"/>
	</register><register id="QSPI_INTC_EOI" acronym="QSPI_INTC_EOI" offset="48" width="32" description="EOI Register.">
		<bitfield id="EOI_VECTOR" width="32" begin="31" end="0" resetval="0x0" description="Number associated with the ipgenericirq for intr output.  There are 1 interrupt outputsWrite 0x0 : Write to intr IP GenericAny other write value is ignored." range="31:0" rwaccess="R/W"/>
	</register><register id="QSPI_MSS_QSPI_RESERVED7" acronym="QSPI_MSS_QSPI_RESERVED7" offset="52" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED8" acronym="QSPI_MSS_QSPI_RESERVED8" offset="56" width="32" description="Reserved.">
		</register><register id="QSPI_MSS_QSPI_RESERVED9" acronym="QSPI_MSS_QSPI_RESERVED9" offset="60" width="32" description="Reserved.">
		</register><register id="QSPI_SPI_CLOCK_CNTRL" acronym="QSPI_SPI_CLOCK_CNTRL" offset="64" width="32" description="SPI Clock Control Register (SPICC).">
		<bitfield id="CLKEN" width="1" begin="31" end="31" resetval="0x0" description="Clock Enable. 0- Data clock is turned off1- Data clock is enabled" range="31" rwaccess="R/W"/>
	<bitfield id="RESERVED" width="15" begin="30" end="16" resetval="0x0" description="Always read as 0" range="30:16" rwaccess="R"/>
	<bitfield id="DCLK_DIV" width="16" begin="15" end="0" resetval="0x0" description="Serial data clock divide by ratio" range="15:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_DC" acronym="QSPI_SPI_DC" offset="68" width="32" description="SPI Data Control Register (SPIDC).">
		<bitfield id="RESERVED4" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="DD3" width="2" begin="28" end="27" resetval="0x0" description="Data delay for chip select 300-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="28:27" rwaccess="R/W"/>
	<bitfield id="CKPH3" width="1" begin="26" end="26" resetval="0x0" description="Clock phase for chip select 3 If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="26" rwaccess="R/W"/>
	<bitfield id="CSP3" width="1" begin="25" end="25" resetval="0x0" description="Chip select polarity for chip select 30- Active low1- Active high" range="25" rwaccess="R/W"/>
	<bitfield id="CKP3" width="1" begin="24" end="24" resetval="0x0" description="Clock polarity for chip select 30- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="24" rwaccess="R/W"/>
	<bitfield id="RESERVED3" width="3" begin="23" end="21" resetval="0x0" description="Always read as 0" range="23:21" rwaccess="R"/>
	<bitfield id="DD2" width="2" begin="20" end="19" resetval="0x0" description="Data delay for chip select 200-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="20:19" rwaccess="R/W"/>
	<bitfield id="CKPH2" width="1" begin="18" end="18" resetval="0x0" description="Clock phase for chip select 2.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="18" rwaccess="R/W"/>
	<bitfield id="CSP2" width="1" begin="17" end="17" resetval="0x0" description="Chip select polarity for chip select 20- Active low1- Active high" range="17" rwaccess="R/W"/>
	<bitfield id="CKP2" width="1" begin="16" end="16" resetval="0x0" description="Clock polarity for chip select 20- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="3" begin="15" end="13" resetval="0x0" description="Always read as 0" range="15:13" rwaccess="R"/>
	<bitfield id="DD1" width="2" begin="12" end="11" resetval="0x0" description="Data delay for chip select 100-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="12:11" rwaccess="R/W"/>
	<bitfield id="CKPH1" width="1" begin="10" end="10" resetval="0x0" description="Clock phase for chip select 1.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="10" rwaccess="R/W"/>
	<bitfield id="CSP1" width="1" begin="9" end="9" resetval="0x0" description="Chip select polarity for chip select 10- Active low1- Active high" range="9" rwaccess="R/W"/>
	<bitfield id="CKP1" width="1" begin="8" end="8" resetval="0x0" description="Clock polarity for chip select 10- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="3" begin="7" end="5" resetval="0x0" description="Always read as 0" range="7:5" rwaccess="R"/>
	<bitfield id="DD0" width="2" begin="4" end="3" resetval="0x0" description="Data delay for chip select 000-  Data is output on the same cycle as the CS_N goes active01-  Data is output 1 DCLK cycle after the CS_N goes active 10-  Data is output 2 DCLK cycles after the CS_N goes active11-  Data is output 3 DCLK cycles after the CS_N goes active" range="4:3" rwaccess="R/W"/>
	<bitfield id="CKPH0" width="1" begin="2" end="2" resetval="0x0" description="Clock phase for chip select 0.  If CKP0 = 0  0- Data shifted out on falling edge; input on rising edge  1- Data shifted out on rising edge; input on falling edgeIf CKP0 = 1  1- Data shifted out on falling edge; input on rising edge  0- Data shifted out on rising edge; input on falling edge" range="2" rwaccess="R/W"/>
	<bitfield id="CSP0" width="1" begin="1" end="1" resetval="0x0" description="Chip select polarity for chip select 00- Active low1- Active high" range="1" rwaccess="R/W"/>
	<bitfield id="CKP0" width="1" begin="0" end="0" resetval="0x0" description="Clock polarity for chip select 00- When data is not being transferred, SCK = 01- When data is not being transferred, SCK = 1" range="0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_CMD" acronym="QSPI_SPI_CMD" offset="72" width="32" description="SPI Command Register (SPICR).">
		<bitfield id="RESERVED3" width="2" begin="31" end="30" resetval="0x0" description="Always read as 0" range="31:30" rwaccess="R"/>
	<bitfield id="CSNUM" width="2" begin="29" end="28" resetval="0x0" description="Device select.  Sets the active chip select for the transfer00-  Chip Select 0 active01-  Chip Select 1 active10-  Chip Select 2 active11-  Chip Select 3 active" range="29:28" rwaccess="R/W"/>
	<bitfield id="RESERVED2" width="2" begin="27" end="26" resetval="0x0" description="Always read as 0" range="27:26" rwaccess="R"/>
	<bitfield id="WLEN" width="7" begin="25" end="19" resetval="0x0" description="Word length.  Sets the size of the individual transfers from 1  128 bits0- 1 bit1- 2 bits127  128 bits" range="25:19" rwaccess="R/W"/>
	<bitfield id="CMD" width="3" begin="18" end="16" resetval="0x0" description="Transfer command000-  Reserved001-  4 pin Read Single 010-  4 pin Write  Single011-  4 pin Read Dual100  Reserved101  3 pin Read Single110  3 pin Write Single 111  6 pin Read Quad" range="18:16" rwaccess="R/W"/>
	<bitfield id="FIRQ" width="1" begin="15" end="15" resetval="0x0" description="Frame count interrupt enable" range="15" rwaccess="R/W"/>
	<bitfield id="WIRQ" width="1" begin="14" end="14" resetval="0x0" description="Word count interrupt enable" range="14" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="2" begin="13" end="12" resetval="0x0" description="Always read as 0" range="13:12" rwaccess="R"/>
	<bitfield id="FLEN" width="12" begin="11" end="0" resetval="0x0" description="Frame Length0- 1 word1- 2 words40954096words" range="11:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_STATUS" acronym="QSPI_SPI_STATUS" offset="76" width="32" description="SPI Status Register (SPISR).">
		<bitfield id="RESERVED2" width="4" begin="31" end="28" resetval="0x0" description="Always read as 0" range="31:28" rwaccess="R"/>
	<bitfield id="WDCNT" width="12" begin="27" end="16" resetval="0x0" description="Word count.  This field will reflect the 14096words transferred" range="27:16" rwaccess="R"/>
	<bitfield id="RESERVED1" width="13" begin="15" end="3" resetval="0x0" description="Always read as 0" range="15:3" rwaccess="R"/>
	<bitfield id="FC" width="1" begin="2" end="2" resetval="0x0" description="Frame complete.  This bit is set after all of the requested words have been transmitted.0- Transfer is not complete1- Transfer is completeThis bit is reset when the SPI Status Register is read" range="2" rwaccess="R"/>
	<bitfield id="WC" width="1" begin="1" end="1" resetval="0x0" description="Word complete.  This bit is set after each word transfer is completed.0- Word transfer is not complete1- Word transfer is completeThis bit is reset when the SPI Status Register is read" range="1" rwaccess="R"/>
	<bitfield id="BUSY" width="1" begin="0" end="0" resetval="0x0" description="Busy bit.  Active transfer in progress.  This bit is only set during an active word transfer.  Between words, the bit will clear to signal that it is ok to read/write the data registers.0- Idle1- Busy" range="0" rwaccess="R"/>
	</register><register id="QSPI_SPI_DATA" acronym="QSPI_SPI_DATA" offset="80" width="32" description="SPI Data Register (SPIDR).">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_SETUP0" acronym="QSPI_SPI_SETUP0" offset="84" width="32" description="Memory Mapped SPI Setup0 Register.">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28:24" rwaccess="R/W"/>
	<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15:14" rwaccess="R"/>
	<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00  Normal read [all data input on spi_din]01  Dual read [odd bytes input on spi_din; even on spi_dout]10  Normal read [all data input on spi_din]11  Quad read [uses spi_qdin0/1]" range="13:12" rwaccess="R/W"/>
	<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11:10" rwaccess="R/W"/>
	<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9:8" rwaccess="R/W"/>
	<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_SETUP1" acronym="QSPI_SPI_SETUP1" offset="88" width="32" description="Memory Mapped SPI Setup1 Register.">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28:24" rwaccess="R/W"/>
	<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15:14" rwaccess="R"/>
	<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00  Normal read [all data input on spi_din]01  Dual read [odd bytes input on spi_din; even on spi_dout]10  Normal read [all data input on spi_din]11  Quad read [uses spi_qdin0/1]" range="13:12" rwaccess="R/W"/>
	<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11:10" rwaccess="R/W"/>
	<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9:8" rwaccess="R/W"/>
	<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_SETUP2" acronym="QSPI_SPI_SETUP2" offset="92" width="32" description="Memory Mapped SPI Setup2 Register.">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28:24" rwaccess="R/W"/>
	<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15:14" rwaccess="R"/>
	<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00  Normal read [all data input on spi_din]01  Dual read [odd bytes input on spi_din; even on spi_dout]10  Normal read [all data input on spi_din]11  Quad read [uses spi_qdin0/1]" range="13:12" rwaccess="R/W"/>
	<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11:10" rwaccess="R/W"/>
	<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9:8" rwaccess="R/W"/>
	<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_SETUP3" acronym="QSPI_SPI_SETUP3" offset="96" width="32" description="Memory Mapped SPI Setup3 Register.">
		<bitfield id="RESERVED2" width="3" begin="31" end="29" resetval="0x0" description="Always read as 0" range="31:29" rwaccess="R"/>
	<bitfield id="NUM_D_BITS" width="5" begin="28" end="24" resetval="0x0" description="Number of dummy bits to use if NUM_D_BYTES = 0" range="28:24" rwaccess="R/W"/>
	<bitfield id="WCMD" width="8" begin="23" end="16" resetval="0x2" description="Write Command" range="23:16" rwaccess="R/W"/>
	<bitfield id="RESERVED1" width="2" begin="15" end="14" resetval="0x0" description="Always read as 0" range="15:14" rwaccess="R"/>
	<bitfield id="READ_TYPE" width="2" begin="13" end="12" resetval="0x0" description="Determines if the read command is a single, dual or quad read mode command00  Normal read [all data input on spi_din]01  Dual read [odd bytes input on spi_din; even on spi_dout]10  Normal read [all data input on spi_din]11  Quad read [uses spi_qdin0/1]" range="13:12" rwaccess="R/W"/>
	<bitfield id="NUM_D_BYTES" width="2" begin="11" end="10" resetval="0x0" description="Number of dummy bytes to be used for fast read. 0 = use the value in NUM_D_BITS1 = use 8 bits; 2 = use 16 bits; 3 = use 24 bits" range="11:10" rwaccess="R/W"/>
	<bitfield id="NUM_A_BYTES" width="2" begin="9" end="8" resetval="0x2" description="Number of address bytes to be sent. 0 = 1 byte; 1 = 2 bytes; 2 = 3 bytes; 3 = 4 bytes" range="9:8" rwaccess="R/W"/>
	<bitfield id="RCMD" width="8" begin="7" end="0" resetval="0x3" description="Read Command" range="7:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_SWITCH" acronym="QSPI_SPI_SWITCH" offset="100" width="32" description="Memory Mapped SPI Switch Register.">
		<bitfield id="RESERVED" width="30" begin="31" end="2" resetval="0x0" description="Always read as 0" range="31:2" rwaccess="R"/>
	<bitfield id="MM_INT_EN" width="1" begin="1" end="1" resetval="0x0" description="Memory Mapped mode interrupt enable.0  Interrupts are disabled during memory mapped operations1  Word Count interrupt is enabled for memory mapped operations" range="1" rwaccess="R/W"/>
	<bitfield id="MMPT_S" width="1" begin="0" end="0" resetval="0x0" description="MMPT select.  If 0 [default] config port has is selected to control config of core SPI module.  If 1, Memory Mapped Protocol Translator is selected to control config port of core SPI module." range="0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_DATA1" acronym="QSPI_SPI_DATA1" offset="104" width="32" description="SPI Data Register (SPIDR1).">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_DATA2" acronym="QSPI_SPI_DATA2" offset="108" width="32" description="SPI Data Register (SPIDR2).">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31:0" rwaccess="R/W"/>
	</register><register id="QSPI_SPI_DATA3" acronym="QSPI_SPI_DATA3" offset="112" width="32" description="SPI Data Register (SPIDR3).">
		<bitfield id="DATA" width="32" begin="31" end="0" resetval="0x0" description="Data register for read and write operations" range="31:0" rwaccess="R/W"/>
	</register>
</module>